export const questions = [
  {
    text: "1.หลักจากเลิกจากงานกีฬาสีของโรงเรียน พี่ต้นน้ำ ชั้น ม.3 กำลังจะกลับบ้าน แต่มีฝนตก ฟ้าร้อง คิดว่าทำไมนักเรียนคนนี้จึงตัดสินใจขับรถฝ่าสายฝนกลับบ้าน",
    choices: [
      { text: "คิดว่าไม่ถึงทำให้มองไม่เห็น", type: "Impulsivity" },
      { text: "มีความชำนาญกว่าผู้อื่น ๆ", type: "Anti-Authority" },
      { text: "ฝนคงไม่หยุดตกง่ายๆ", type: "Resignation" },
      { text: "อยากรีบกลับบ้าน", type: "Macho" },
      { text: "เจอประจำแต่ก็ไม่เป็นไร ไม่รู้สึกอะไร", type: "Invulnerability" }
    ]
  },
  {
    text: "2.เมื่อนักเรียนขับขี่รถจักรยานยนต์มาโรงเรียน เมื่อใกล้ถึงจุดที่เป็นทางม้าลาย แต่นักเรียนยังคงขับรถด้วยความเร็วสูงเกินกฎหมายกำหนด ทำไมนักเรียนจึงมีพฤติกรรมดังกล่าว",
    choices: [
      { text: "คิดว่าไม่จำเป็นต้องลดความเร็วเพราะขับประจำ", type: "Impulsivity" },
      { text: "ขับด้วยความเร็วเท่านี้หลายครั้งแต่ก็ผ่านไปด้วยดี ๆ", type: "Anti-Authority" },
      { text: "ต้องไปโรงเรียนให้ทันก่อนเคารพธงชาติ", type: "Resignation" },
      { text: "คิดว่าไม่ชะลอก่อนถึงทางม้าลายคงไม่เกิดเหตุร้ายแรง", type: "Macho" },
      { text: "คิดว่าจะเกิดอะไรก็ต้องเกิด", type: "Invulnerability" }
    ]
  },
  {
    text: "3.นักเรียนต้องขับรถจักรยานยนต์ ไปเก็บตัวนักกีฬาที่ต่างอำเภอ ก่อนไปนักเรียนต้องเคลียร์ งานกลุ่มให้เสร็จ ทำให้เดินทางไปถึงสถานที่เก็บตัวนักกีฬาเวลา 22.00 น. ทำไมนักเรียนจึงตัดสินใจ เดินทางไปในเวลาดังกล่าว",
    choices: [
      { text: "ปล่อยเลยตามเลยเพราะต้องไปเก็บตัวนักกีฬาวันนี้", type: "Impulsivity" },
      { text: "ต้องไปเก็บตัวเพราะพรุ่งนี้มีซ้อมตอนเช้า", type: "Anti-Authority" },
      { text: "มืดนิดหน่อยแต่สามารถมองเห็นทางได้", type: "Resignation" },
      { text: "คิดว่ามีทักษะในการขับรถกลางคืนดีกว่าคนอื่น", type: "Macho" },
      { text: "ไปเวลานี้ประจำแต่ก็ไม่เคยเกิดอุบัติเหตุ", type: "Invulnerability" }
    ]
  },
  {
    text: "4.นักเรียนขับรถจักรยานยนต์ไปสอบที่โรงเรียนโดยไม่สวมหมวกกันน็อก ทำไมนักเรียนจึงตัดสินใจดังกล่าว",
    choices: [
      { text: "ต้องรีบไปสอบไม่มีเวลาใส่หมวก", type: "Impulsivity" },
      { text: "กฏหมายการใส่หมวกกันหนอกเป็นเรื่องไม่จริงจัง", type: "Anti-Authority" },
      { text: "ทำหลายครั้งเเล้ว ก็ยังไม่เคยประสบอุบัติเหตุ", type: "Resignation" },
      { text: "เชื่อว่าตัวเองมีความชำนาญในการขับหมวกไม่จำเป็น", type: "Macho" },
      { text: "ใส่หมวกกับไม่ใส่หมวกค่าเท่ากัน", type: "Invulnerability" }
    ]
  },
  {
    text: "5.นักเรียนต้องการไปเที่ยวงานประจำปีกับเพื่อนโดย ขากลับเพื่อนได้ดื่มเบียรและมีการเมา นิดหน่อย แต่นักเรียนยังตัดสินใจกลับบ้านกับเพื่อน เพราะเหตุใด",
    choices: [
      { text: "เชื่อใจในความสามารถการขับรถของเพื่อน", type: "Impulsivity" },
      { text: "มีความชำนาญกว่าผู้อื่น", type: "Anti-Authority" },
      { text: "เป็นเรื่องปกติของเพื่อน เตือนเพื่อนไปก็ไม่ช่วย", type: "Resignation" },
      { text: "เชื่อว่าเพื่อนต้องรีบกลับถ้ารอหายเมาคงไม่ทัน", type: "Macho" },
      { text: "เชื่อว่าการเมาไม่ใช่สาเหตุของอุบัติเหตุสิ่งรอบข้างต่างหาก", type: "Invulnerability" }
    ]
  },
];
