export const questions = [
  {
    text: "หลักจากเลิกจากงานกีฬาสีของโรงเรียน พี่ต้นน้ำ ชั้น ม.3 กำลังจะกลับบ้าน แต่มีฝนตก ฟ้าร้อง คิดว่าทำไมนักเรียนคนนี้จึงตัดสินใจขับรถฝ่าสายฝนกลับบ้าน",
    choices: [
      { text: "คิดว่ายังสามารถมองเห็นได้อยู่", type: "Impulsivity", className: "choice-1" },
      { text: "มีความชำนาญกว่าผู้อื่น", type: "Anti-Authority", className: "choice-2" },
      { text: "ฝนคงไม่หยุดตกง่าย ๆ", type: "Resignation", className: "choice-3" },
      { text: "อยากรีบกลับบ้าน", type: "Invulnerability", className: "choice-4" },
      { text: "เจอประจำแต่ก็ไม่เป็นไร ไม่รู้สึกอะไร", type: "Macho", className: "choice-5" }
    ]
  },
];


// },
  // {
  //   text: "เมื่อนักเรียนขับขี่รถจักรยานยนต์มาโรงเรียน เมื่อใกล้ถึงจุดที่เป็นทางม้าลาย แต่นักเรียนยังคงขับรถด้วยความเร็วสูงเกินกฎหมายกำหนด ทำไมนักเรียนจึงมีพฤติกรรมดังกล่าว",
  //   choices: [
  //     { text1: "คิดว่าไม่จำเป็นต้องลดความเร็วเพราะขับประจำ", type: "Impulsivity" },
  //     { text2: "ขับด้วยความเร็วเท่านี้หลายครั้งแต่ก็ผ่านไปด้วยดี ๆ", type: "Anti-Authority" },
  //     { text3: "ต้องไปโรงเรียนให้ทันก่อนเคารพธงชาติ", type: "Resignation" },
  //     { text4: "คิดว่าไม่ชะลอก่อนถึงทางม้าลายคงไม่เกิดเหตุร้ายแรง", type: "" },
  //     { text5: "คิดว่าจะเกิดอะไรก็ต้องเกิด", type: "" }
  //   ]
  // },
  // {
  //   text: "นักเรียนต้องขับรถจักรยานยนต์ ไปเก็บตัวนักกีฬาที่ต่างอำเภอ ก่อนไปนักเรียนต้องเคลียร์ งานกลุ่มให้เสร็จ ทำให้เดินทางไปถึงสถานที่เก็บตัวนักกีฬาเวลา 22.00 น. ทำไมนักเรียนจึงตัดสินใจ เดินทางไปในเวลาดังกล่าว",
  //   choices: [
  //     { text1: "ปล่อยเลยตามเลยเพราะต้องไปเก็บตัวนักกีฬาวันนี้", type: "Impulsivity" },
  //     { text2: "ต้องไปเก็บตัวเพราะพรุ่งนี้มีซ้อมตอนเช้า", type: "Anti-Authority" },
  //     { text3: "มืดนิดหน่อยแต่สามารถมองเห็นทางได้", type: "Resignation" },
  //     { text4: "คิดว่ามีทักษะในการขับรถกลางคืนดีกว่าคนอื่น", type: "" },
  //     { text5: "ไปเวลานี้ประจำแต่ก็ไม่เคยเกิดอุบัติเหตุ", type: "" }
  //   ]
  // },
  // {
  //   text: "นักเรียนขับรถจักรยานยนต์ไปสอบที่โรงเรียนโดยไม่สวมหมวกกันน็อก ทำไมนักเรียนจึงตัดสินใจดังกล่าว",
  //   choices: [
  //     { text1: "ต้องรีบไปสอบไม่มีเวลาใส่หมวก", type: "Impulsivity" },
  //     { text2: "กฏหมายการใส่หมวกกันหนอกเป็นเรื่องไม่จริงจัง", type: "Anti-Authority" },
  //     { text3: "ทำหลายครั้งเเล้ว ก็ยังไม่เคยประสบอุบัติเหตุ", type: "Resignation" },
  //     { text4: "เชื่อว่าตัวเองมีความชำนาญในการขับหมวกไม่จำเป็น", type: "" },
  //     { text5: "ใส่หมวกกับไม่ใส่หมวกค่าเท่ากัน", type: "" }
  //   ]
  // },
  // {
  //   text: "นักเรียนต้องการไปเที่ยวงานประจำปีกับเพื่อนโดย ขากลับเพื่อนได้ดื่มเบียรและมีการเมา นิดหน่อย แต่นักเรียนยังตัดสินใจกลับบ้านกับเพื่อน เพราะเหตุใด",
  //   choices: [
  //     { text1: "เชื่อใจในความสามารถการขับรถของเพื่อน", type: "Impulsivity" },
  //     { text2: "มีความชำนาญกว่าผู้อื่น", type: "Anti-Authority" },
  //     { text3: "เป็นเรื่องปกติของเพื่อน เตือนเพื่อนไปก็ไม่ช่วย", type: "Resignation" },
  //     { text4: "เชื่อว่าเพื่อนต้องรีบกลับถ้ารอหายเมาคงไม่ทัน", type: "" },
  //     { text5: "เชื่อว่าการเมาไม่ใช่สาเหตุของอุบัติเหตุสิ่งรอบข้างต่างหาก", type: "" }
  //   ]